"""
B. Медианы подотрезков

Ограничение времени	1 секунда
Ограничение памяти	256Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt

Рассмотрим перестановку чисел длины NN. Перестановкой чисел называется последовательность целых чисел от 1 до NN, в которой каждое число встречается ровно один раз.
Подотрезком последовательности AA называется последовательность чисел, получаемая из AA путём отбрасывания некоторого (возможно, нулевого) количества чисел из начала и конца последовательности.
Медианой последовательности нечетной длины называется такое число, которое будет стоять на центральном месте после сортировки последовательности. Например, в последовательности [7,1,20][7,1,20] медианой является число 77.
Определите количество подотрезков заданной перестановки, имеющих нечетную длину, медиана которых в точности равна заданному числу BB.
Формат ввода
В первой строке задаются два числа NN и BB (1≤N≤1051≤N≤105, 1≤B≤N1≤B≤N).
В следующей строке задаются NN чисел AiAi (1≤Ai≤N1≤Ai≤N) — перестановка чисел.
Формат вывода
Выведите одно число — количество подотрезков нечетной длины, медиана которых равна числу BB.

Пример 1
Ввод
5 2
5 4 3 2 1
Вывод
2

Пример 2
Ввод
6 3
3 6 5 4 2 1
Вывод
1

Пример 3
Ввод
7 4
5 7 2 4 3 1 6
Вывод
4

Примечания
В первом примере подходят подотрезки [3,2,1][3,2,1] и [2][2]
Во втором примере подходит только подотрезок [3][3]
В третьем примере подходят подотрезки [5,7,2,4,3,1,6][5,7,2,4,3,1,6], [5,7,2,4,3][5,7,2,4,3], [7,2,4][7,2,4] и [4][4]

"""